# solaar # Only necessary for logitech peripherals
alacritty
arc-gtk-theme
audacity
base
base-devel
bash-completion
bat
bleachbit
chromium # Tenative inclusion.
cronie
cronie # Tenative inclusion.
cryptomator
direnv
discord
dmenu
dunst
easyeffects
efibootmgr
exfatprogs
firefox
flameshot
gimp
git
git-delta
gparted
grub
grub-customizer
gvfs-mtp # Tenative inclusion.
i3-wm
i3blocks
i3lock
interception-dual-function-keys # Tenative inclusion.
jq
keepassxc
less
libreoffice-fresh
light
lightdm
lightdm-gtk-greeter
lightdm-gtk-greeter-settings
linux-firmware
linux-lts
linux-lts-headers
lxappearance-gtk3 # Tenative inclusion. Prefer gtk4 alternative
man-db
man-pages
mediainfo-gui # Tenative inclusion.
mtpfs # Tenative inclusion.
ncdu
neovim
network-manager-applet
nsxiv
ntfs-3g
ntp # Keep current time up to date
opendoas
os-prober
pacman-contrib
papirus-icon-theme
pasystray
pavucontrol
picom
pipewire
pipewire-pulse
polkit-gnome
powertop
pyenv
python-pip
python-pipx
qt5ct
rclone
redshift
reflector
ripgrep
rsync
shellcheck
sudo
sxhkd
thermald
thunar
thunar-archive-plugin
tmux
tree
tumbler
udisks2
veracrypt
vim
whipper # Tenative inclusion.
wireplumber
xarchiver
xclip
xdg-utils
xdotool
xorg-server-xephyr
xorg-xev
xorg-xinit
xorg-xinput
xorg-xprop
xsel
yad # Used for calendar
zathura-pdf-mupdf
zsh
zsh-completions
